Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportSelectParametricProfileItemByPrefix(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportSelectParametricProfileItemByTypeAndSubType(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportSelectParametricProfileItemByProfileName(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportSelectProfileItemByTypeAndSubType(System.Int32,System.Int32,System.Int32,Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
ProfileItemType: The profile item type.
ProfileItemSubType: The profile item sub type.
CrossSectionNumber: The cross section number.
rProfileItem: The profile item instance.
Returns: True if success, otherwise false.

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportSelectProfileItemSubTypes(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,Tekla.Structures.CatalogInternal.dotcatProfileItemSubTypeEnumerator_t@)
DO NOT USE! For internal usage only!
pProfileItem:
pProfileItemSubTypeEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.AddCrossSection(System.String,System.Int32,System.Double,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
CrossSectionNumber: The cross section number.
Location: The location value.
Type: The type number.
SubType: The subtype number.
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ModifyCrossSection(System.String,System.Int32,System.Double,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
CrossSectionNumber: The cross section number.
Location: The location value.
Type: The type number.
SubType: The subtype number.
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportFinishList
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.DeleteCrossSection(System.String,System.Int32)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
CrossSectionNumber: The cross section number.
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.SetEquivalentType(System.String,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
CrossSectionNumber: The cross section number.
EquivalentType: The equivalent type.
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.GetProfileItemCrossSection(System.String,System.Int32,Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t@)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
isParametric: Specify is the profile is parametric or not.
CrossSection: The cross section.
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ModifyProfileItemProperties(Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s@)
DO NOT USE! For internal usage only!
ProfileItemProperties: The profile item properties.
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.GetProfileItemPropertiesByTypeAndSubType(System.Int32,System.Int32,Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t@)
DO NOT USE! For internal usage only!
Type: The profile type.
SubType: The profile sub type.
CrossSection: The profile item cross section.
Returns: True on success.

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportProfileItemsToFile(Tekla.Structures.CatalogInternal.dotcatProfileNames_t@,System.String,System.String)
DO NOT USE! For internal usage only!
profileNames: The profile item names.
path: The file path.
fileName: The file name.
Returns: 1 on success.

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportAddProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,Tekla.Structures.CatalogInternal.dotcatProfileName_t@)
DO NOT USE! For internal usage only!
pProfileItem:
pNewName:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportGetParametricProfileTypeByPrefix(System.String,System.Int32@)
DO NOT USE! For internal usage only!
pProfilePrefix:
rProfileType:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportGetProfileType(System.String,System.Int32@)
DO NOT USE! For internal usage only!
pProfileName:
rProfileType:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportProfileItemProperties(Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s@)
DO NOT USE! For internal usage only!
pProfileItemProperties: The profile item properties.
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportRenameProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,Tekla.Structures.CatalogInternal.dotcatProfileName_t@)
DO NOT USE! For internal usage only!
pProfileItem:
pNewName:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportDeleteUserParametricProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportSaveProfileDatabaseNew
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportCreateSavePoint
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportRollbackToSavePoint
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportFinalizeImportProfilesFromFolderWithoutSave(System.Collections.Generic.List{System.Object}@)
DO NOT USE! For internal usage only!
pConflicts:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportImportCustomComponentsFromPathWithUpdateCheck(System.String,System.Boolean)
DO NOT USE! For internal usage only!
Path:
ForcedUpdate:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportGetTranslatedOptionLabels(Tekla.Structures.CatalogInternal.dotcatUserPropertyOption2_t@)
DO NOT USE! For internal usage only!
userPropertyOption2:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.ExportConvertFabricatorProfilesAndMaterialsToTS(Tekla.Structures.CatalogInternal.dotcatFabricatorDataFilePaths_t@)
DO NOT USE! For internal usage only!
FabricatorDataFilePaths:
Returns:

Tekla.Structures.CatalogInternal.CDelegateWrapper.GetShapeByGuid(Tekla.Structures.CatalogInternal.dotcatShape_t@,System.String)
